#!/bin/bash
#Первая строка запускает Bash

pwd

#Даем разрешения для файла сценария
chmod +x ./AdditionalSoftInstall.sh

echo ---------------------------------
echo ---------------------------------
echo - Сейчас мы добавим необходимые -
echo --------- репозитории -----------
echo ----------- затем ---------------
echo --------- обновим их ------------
echo ---------------------------------
echo ---------------------------------


#Добавить репозиторий Java
sudo add-apt-repository ppa:webupd8team/java

#Удалим старую версию Java
sudo apt remove openjdk*

#Обновить текущие репозитории и исправить зависимости
sudo apt-get update
sudo apt-get install -f

#=============================================================

echo ---------------------------------
echo ---------------------------------
echo ---- Сейчас будет установлен ----
echo ------------ Java 8 -------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

sudo apt-get install java-common oracle-java8-installer
sudo apt-get install default-jdk
source /etc/profile

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ------ Установка завершена ------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#=============================================================

echo ---------------------------------
echo ---------------------------------
echo ---- Сейчас будет установлен ----
echo ----------- PhpStorm ------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

sudo chmod -R 777 /opt/phpstorm/
sudo rm -rf /opt/phpstorm/

wget https://download-cf.jetbrains.com/webide/PhpStorm-2016.3.3.tar.gz
tar xvf PhpStorm-2016.3.3.tar.gz
sudo mv PhpStorm-163.13906.21/ /opt/phpstorm/
sudo ln -s /opt/phpstorm/bin/phpstorm.sh /usr/local/bin/phpstorm

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ------ Установка завершена ------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------



#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo --- Исправление зависимостей ----
echo -------- и обновление -----------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

sudo apt-get update
sudo apt-get install -f

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo --- Работа скрипта завершена ----
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++