#!/bin/bash
#Первая строка запускает Bash

pwd

#Даем разрешения для файла сценария
chmod +x ./SoftInstall.sh

echo ---------------------------------
echo ---------------------------------
echo - Сейчас мы добавим необходимые -
echo --------- очистим вашу ----------
echo ----------- систму --------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#Удалить неиспользуемые пакеты из кеша
sudo apt-get autoclean

#Очистка кэша в Ubuntu, утилиты apt
sudo apt-get clean

#Удаление ненужных зависимостей
sudo apt-get autoremove

#Удаление старые версии конфигурационных файлов
dpkg -l | awk '/^rc/ {print $2}' | xargs sudo dpkg --purge

echo ---------------------------------
echo ---------------------------------
echo ---- Процесс Очистки закончен ---
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------