#!/bin/bash
#Первая строка запукает Bash

#Даем разрешения для файла сценария как ПО

echo ---------------------------------
echo ---------------------------------
echo - Сейчас мы настроим ваши часы --
echo --------- под UTC ---------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

sudo timedatectl set-local-rtc 1 --adjust-system-clock
sudo timedatectl
sudo sed -i 's/UTC=yes/UTC=no/' /etc/default/rcS

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo --- Работа скрипта завершена ----
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------