#!/bin/bash
#Первая строка запускает Bash

pwd

#Даем разрешения для файла сценария
chmod +x ./QTCreator.sh

echo ---------------------------------
echo ---------------------------------
echo - Сейчас мы добавим необходимые -
echo --------- репозитории -----------
echo ----------- затем ---------------
echo --------- обновим их ------------
echo ---------------------------------
echo ---------------------------------


#Добавить репозиторий QTCreator
sudo wget http://download.qt.io/official_releases/online_installers/qt-unified-linux-x64-online.run


#Обновить текущие репозитории и исправить зависимости
sudo apt-get update

#=============================================================

echo ---------------------------------
echo ---------------------------------
echo ---- Сейчас будет установлен ----
echo ----------- QTCreator -----------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#Даем необходимые права для запуска установщика
chmod u+x qt-unified-linux-x64-3.0.2-online.run
./qt-unified-linux-x64-3.0.2-online.run

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ------ Установка завершена ------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo --- Исправление зависимостей ----
echo -------- и обновление -----------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

sudo apt-get update
sudo apt-get install -f

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo --- Работа скрипта завершена ----
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++