#!/bin/bash
#Первая строка запускает Bash

pwd

#Даем разрешения для файла сценария
chmod +x ./SoftInstall.sh

echo ---------------------------------
echo ---------------------------------
echo - Сейчас мы добавим необходимые -
echo --------- репозитории -----------
echo ----------- затем ---------------
echo --------- обновим их ------------
echo ---------------------------------
echo ---------------------------------

#Добавить репозиторий SublimeText3 и ключ GPG
wget -qO - https://download.sublimetext.com/sublimehq-pub.gpg | sudo apt-key add -
sudo apt-get install apt-transport-https
echo "deb https://download.sublimetext.com/ apt/stable/" | sudo tee /etc/apt/sources.list.d/sublime-text.list
echo ----------------------------------------------------

#Добавить репозитрий Double Commander
sudo add-apt-repository ppa:alexx2000/doublecmd
echo ----------------------------------------------------

#Добавить репозиторий Telegram
sudo add-apt-repository ppa:atareao/telegram
echo ----------------------------------------------------

#Добавить репозиторий и ключ доступа Google Chrome
wget -q -O - https://dl-ssl.google.com/linux/linux_signing_key.pub | sudo apt-key add -
sudo sh -c 'echo "deb [arch=amd64] http://dl.google.com/linux/chrome/deb/ stable main" > /etc/apt/sources.list.d/google-chrome.list'
echo ----------------------------------------------------

#Добавить в репозиторий GIMP
sudo add-apt-repository ppa:otto-kesselgulasch/gimp
echo ----------------------------------------------------

#Добавить в репозитории Skype
wget -q -O - https://repo.skype.com/data/SKYPE-GPG-KEY | sudo apt-key add -
sudo sh -c 'echo "deb [arch=amd64] https://repo.skype.com/deb stable main" > /etc/apt/sources.list.d/skype-stable.list'
echo ----------------------------------------------------

#Добавить в репозитории Reminna Desktop
sudo apt-add-repository ppa:remmina-ppa-team/remmina-next
echo ----------------------------------------------------

#Добавить в репозиторий vlc
sudo add-apt-repository ppa:n-muench/vlc

#Добавить в репозитории архитектуру x32
sudo dpkg --add-architecture i386



#Обновить текущие репозитории и исправить зависимости
sudo apt-get update
sudo apt-get install -f


#=============================================================
echo ---------------------------------
echo ---------------------------------
echo ---- Сейчас будет установлен ----
echo --------- SublimeText3 ----------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

sudo apt-get install sublime-text

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ------ Установка завершена ------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#=============================================================

echo ---------------------------------
echo ---------------------------------
echo ---- Сейчас будет установлен ----
echo ------- Double Commander --------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

sudo apt install doublecmd-gtk
sudo apt-get install doublecmd-qt

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ------ Установка завершена ------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#=============================================================

echo ---------------------------------
echo ---------------------------------
echo ---- Сейчас будет установлен ----
echo ----------- Telegram ------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

 sudo apt install telegram

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ------ Установка завершена ------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#=============================================================

echo ---------------------------------
echo ---------------------------------
echo ---- Сейчас будет установлен ----
echo -------- Google Chrome ----------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

 sudo apt install google-chrome-stable

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ------ Установка завершена ------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#=============================================================

echo ---------------------------------
echo ---------------------------------
echo ---- Сейчас будет установлен ----
echo ------------ GIMP ---------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

sudo apt-get install gimp

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ------ Установка завершена ------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#=============================================================

echo ---------------------------------
echo ---------------------------------
echo ---- Сейчас будет установлен ----
echo ------------ Skype --------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

sudo apt-get install skypeforlinux -y

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ------ Установка завершена ------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#=============================================================

echo ---------------------------------
echo ---------------------------------
echo ---- Сейчас будет установлен ----
echo ------- Reminna Desktop ---------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

sudo apt-get install remmina remmina-plugin-rdp

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ------ Установка завершена ------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#=============================================================

echo ---------------------------------
echo ---------------------------------
echo ---- Сейчас будет установлен ----
echo ---------- TeamWiever -----------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

wget http://download.teamviewer.com/download/version_11x/teamviewer_i386.deb
sudo dpkg -i teamviewer*.deb

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ------ Установка завершена ------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#=============================================================

echo ---------------------------------
echo ---------------------------------
echo ---- Сейчас будет установлен ----
echo ---------- VLC Player -----------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

sudo apt-get install vlc

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ------ Установка завершена ------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo --- Исправление зависимостей ----
echo -------- и обновление -----------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

sudo apt-get update
sudo apt-get install -f

echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo --- Работа скрипта завершена ----
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------
echo ---------------------------------

#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++